DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvTimer.c
/*---------------------------------------------------------------------------------------------------------*/
/*                                                                                                         */
/* Copyright(c) 2009 Nuvoton Technology Corp. All rights reserved.                                         */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
 
/*---------------------------------------------------------------------------------------------------------*/
/* Includes of system headers                                                                              */
/*---------------------------------------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of local headers                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
#include "NUC100.h"
#include "Driver/DrvTimer.h"
#include "Driver/DrvSYS.h"
/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
#define TIMER_EVENT_COUNT   10
#define TICKS_PER_SECOND    100
#define TIMER_OFFSET        0x4

/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
static TIMER_EVENT_T tTime0Event[TIMER_EVENT_COUNT],
              		 tTime1Event[TIMER_EVENT_COUNT],
			  		 tTime2Event[TIMER_EVENT_COUNT],
			  		 tTime3Event[TIMER_EVENT_COUNT];

static TIMER_CALLBACK fnCallBack_WDT;

static int32_t  bIsTimer0Initial     = FALSE,
               	bIsTimer1Initial     = FALSE,
			    bIsTimer2Initial     = FALSE,
			    bIsTimer3Initial     = FALSE,
                bIsTimer0Used      	 = FALSE,
                bIsTimer1Used      	 = FALSE,
				bIsTimer2Used      	 = FALSE,
				bIsTimer3Used      	 = FALSE,
                bIsSetTime0Event     = FALSE,
                bIsSetTime1Event     = FALSE,
			    bIsSetTime2Event     = FALSE,
			    bIsSetTime3Event     = FALSE,
                bIsSetWdtEvent       = FALSE;

static int32_t volatile bIsWdtTimeOut = FALSE;

static uint32_t volatile uTimer0Count = 0,
                		 uTimer1Count = 0,
                		 uTimer2Count = 0,
                		 uTimer3Count = 0,
						 uTime0EventCount = 0,
                		 uTime1EventCount = 0,
			    		 uTime2EventCount = 0,
                		 uTime3EventCount = 0;

static uint32_t volatile _sys_uTimer0TickPerSecond,
						 _sys_uTimer1TickPerSecond,
						 _sys_uTimer2TickPerSecond, 
						 _sys_uTimer3TickPerSecond;



/*---------------------------------------------------------------------------------------------------------*/
/* Function:     GetTimerCLk                                                                       		   */
/*                                                                                                         */
/* Parameter:        																					   */	
/*	             ch          		-[in] Timer Channel :Could be TMR0,TMR1,TMR2,TMR3                      */
/* Returns:                                                                                                */
/*               Current Timer Clock                                                                       */
/* Description:                                                                                            */
/*               The function is used to get Uart clock                                                    */
/*---------------------------------------------------------------------------------------------------------*/
static uint32_t GetTimerCLk(TIMER_CHANNEL ch)
{
	volatile uint32_t clk =0 ;
	
	
	if(ch == TMR0 )
	{
		if(SYSCLK->CLKSEL1.TMR0_S == 0)			
		{
			clk = DrvSYS_GetEXTClock() * 1000;	/* Option 0: Get External Clock From DrvSYS Setting */
		}
		else if(SYSCLK->CLKSEL1.TMR0_S == 1)
		{
			clk = 32000;						/* Option 1: 32K */
		}
		else if(SYSCLK->CLKSEL1.TMR0_S == 2)
		{
			clk = DrvSYS_GetPLLClock() * 1000 ;	/* Option 2: HCLK */
		}
		else if(SYSCLK->CLKSEL1.TMR0_S == 3)
		{
												/* Option 3: External Trigger */
		}
		else 
		{
			clk = 22000000; 					/* Option 4: 22MHz*/
		}

	}
	else if(ch == TMR1 )
	{
    	if(SYSCLK->CLKSEL1.TMR1_S == 0)			
		{
			clk = DrvSYS_GetEXTClock() * 1000;	/* Option 0: Get External Clock From DrvSYS Setting */
		}
		else if(SYSCLK->CLKSEL1.TMR1_S == 1)
		{
			clk = 32000;						/* Option 1: 32K */
		}
		else if(SYSCLK->CLKSEL1.TMR1_S == 2)
		{
			clk = DrvSYS_GetPLLClock() * 1000 ;	/* Option 2: HCLK */
		}
		else if(SYSCLK->CLKSEL1.TMR1_S == 3)
		{
												/* Option 3: External Trigger */
		}
		else 
		{
			clk = 22000000; 					/* Option 4: 22MHz*/
		}
	}
	else if(ch == TMR2 )
    {
	    if(SYSCLK->CLKSEL1.TMR2_S == 0)			
		{
			clk = DrvSYS_GetEXTClock() * 1000;	/* Option 0: Get External Clock From DrvSYS Setting */
		}
		else if(SYSCLK->CLKSEL1.TMR2_S == 1)
		{
			clk = 32000;						/* Option 1: 32K */
		}
		else if(SYSCLK->CLKSEL1.TMR2_S == 2)
		{
			clk = DrvSYS_GetPLLClock() * 1000 ;	/* Option 2: HCLK */
		}
		else if(SYSCLK->CLKSEL1.TMR2_S == 3)
		{
												/* Option 3: External Trigger */
		}
		else 
		{
			clk = 22000000; 					/* Option 4: 22MHz*/
		}
	
