DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvTimer.c
	}
	else if(ch == TMR3 )
    {
	    if(SYSCLK->CLKSEL1.TMR3_S == 0)			
		{
			clk = DrvSYS_GetEXTClock() * 1000;	/* Option 0: Get External Clock From DrvSYS Setting */
		}
		else if(SYSCLK->CLKSEL1.TMR3_S == 1)
		{
			clk = 32000;						/* Option 1: 32K */
		}
		else if(SYSCLK->CLKSEL1.TMR3_S == 2)
		{
			clk = DrvSYS_GetPLLClock() * 1000 ;	/* Option 2: HCLK */
		}
		else if(SYSCLK->CLKSEL1.TMR3_S == 3)
		{
												/* Option 3: External Trigger */
		}
		else 
		{
			clk = 22000000; 					/* Option 4: 22MHz*/
		}
	}
	else 
    	return E_DRVTIMER_CHANNEL;
			

	return clk;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_GetStatus                                                                           */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               NONE                                                                                      */
/*                                                                                                         */
/* Returns:      Register TISR data                                                                        */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to return read TIMER TISR register to get timer interrupt status    */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvTIMER_GetStatus(TIMER_CHANNEL ch)
{
	int32_t IsStatus;

	if(ch == TMR0 )
		IsStatus =  TIMER0->TISR.TIF ;
	else if(ch == TMR1 )
    	IsStatus =  TIMER1->TISR.TIF ;
	else if(ch == TMR2 )
    	IsStatus =  TIMER2->TISR.TIF ;
	else if(ch == TMR3 )
    	IsStatus =  TIMER3->TISR.TIF ;
	else 
    	return E_DRVTIMER_CHANNEL;

	return IsStatus;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER0 ISR                                                                                */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               NONE                                                                                      */
/* Returns:      NONE                                                                                      */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               The TIMER0 default ISR                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
void TMR0_IRQHandler(void)
{
    int32_t i;
   
    uTimer0Count++;

 	TIMER0->TISR.TIF =1;
 
 	if (bIsSetTime0Event)                               /* Timer Event Handle                               */
    {
        for (i=0; i<TIMER_EVENT_COUNT; i++)
        {
            if (tTime0Event[i].active)
            {
                tTime0Event[i].curTick--;
                if (tTime0Event[i].curTick == 0)
                {
                    (*tTime0Event[i].funPtr)(tTime0Event[i].transParam);
                    tTime0Event[i].curTick = tTime0Event[i].initTick;
                }
            }
        }
    }
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function:     Timer1_ISR                                                                                */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               NONE                                                                                      */
/*                                                                                                         */
/* Returns:      NONE                                                                                      */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               The TIMER1 default ISR                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
void TMR1_IRQHandler(void)
{
    int32_t i;
    
    uTimer1Count++;

  	TIMER1->TISR.TIF =1;
    if (bIsSetTime1Event)                           /* Timer Event Handle                                  */
    {
        for (i=0; i<TIMER_EVENT_COUNT; i++)
        {
            if (tTime1Event[i].active)
            {
                tTime1Event[i].curTick--;
                if (tTime1Event[i].curTick == 0)
                {
                    (*tTime1Event[i].funPtr)(tTime1Event[i].transParam);
                    tTime1Event[i].curTick = tTime1Event[i].initTick;
                }
            }
        }
    }
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function:     Timer2_ISR                                                                                */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               NONE                                                                                      */
/*                                                                                                         */
/* Returns:      NONE                                                                                      */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               The TIMER2 default ISR                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
void TMR2_IRQHandler(void)
{

    int32_t i;
    
    uTimer2Count++;

	TIMER2->TISR.TIF =1;
    if (bIsSetTime2Event)                           /* Timer Event Handle                                  */
    {
        for (i=0; i<TIMER_EVENT_COUNT; i++)
        {
            if (tTime2Event[i].active)
            {
                tTime2Event[i].curTick--;
                if (tTime2Event[i].curTick == 0)
                {
                    (*tTime2Event[i].funPtr)(tTime2Event[i].transParam);
                    tTime2Event[i].curTick = tTime2Event[i].initTick;
                }
            }
        }
    }
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     Timer3_ISR                                                                                */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               NONE                                                                                      */
/*                                                                                                         */
/* Returns:      NONE                                                                                      */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               The TIMER3 default ISR                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
void TMR3_IRQHandler(void)
{

    int32_t i;
    
    uTimer3Count++;

	TIMER3->TISR.TIF =1;
    if (bIsSetTime3Event)                           /* Timer Event Handle                                  */
    {
        for (i=0; i<TIMER_EVENT_COUNT; i++)
        {
            if (tTime3Event[i].active)
            {
                tTime3Event[i].curTick--;
                if (tTime3Event[i].curTick == 0)
                {
                    (*tTime3Event[i].funPtr)(tTime3Event[i].transParam);
                    tTime3Event[i].curTick = tTime3Event[i].initTick;
                }
            }
        }
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_SetTimerEvent                                                                       */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               channel    - [in],  TMR0/TMR1/TMR2/TMR3                          		                   */
/*               uTimeTick  - [in],  The tick value which want to execute event                            */
/*               pvFun      - [in],  The event function pointer                                            */
/*               parameter  - [in],  a parameter,was defined by user,which send to callback function       */
/*                                                                                                         */
/* Returns:      val        - [out],  The event number which contains this event                           */
/* Description:                                                                                            */
/*               This function is used to install a timer event				                               */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvTIMER_SetTimerEvent(TIMER_CHANNEL channel, uint32_t uTimeTick, TIMER_CALLBACK pvFun ,uint32_t parameter)
{
    int32_t volatile i;
    int32_t val=0;


