DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvTimer.c
    switch (channel)
    {
        case TMR0:
        {
            bIsSetTime0Event = TRUE;
            uTime0EventCount++;
            for (i=0; i<TIMER_EVENT_COUNT; i++)
            {
                if (tTime0Event[i].active  == FALSE)
                {
                    tTime0Event[i].active   	= TRUE;
                    tTime0Event[i].initTick 	= uTimeTick;
                    tTime0Event[i].curTick  	= uTimeTick;
                    tTime0Event[i].funPtr   	= (TIMER_CALLBACK)pvFun;
                    tTime0Event[i].transParam   = parameter;
                    val = i;
                    break;
                }
            }
            break;
        }
        case TMR1:
        {
            bIsSetTime1Event = TRUE;
            uTime1EventCount++;
            for (i=0; i<TIMER_EVENT_COUNT; i++)
            {
                if (tTime1Event[i].active   == FALSE)
                {
                    tTime1Event[i].active   	= TRUE;
                    tTime1Event[i].initTick 	= uTimeTick;
                    tTime1Event[i].curTick  	= uTimeTick;
                    tTime1Event[i].funPtr   	= (TIMER_CALLBACK)pvFun;
                    tTime1Event[i].transParam   = parameter;
                    val = i;
                    break;
                }
            }
            break;
        }

        case TMR2:
        {
            bIsSetTime1Event = TRUE;
            uTime2EventCount++;
            for (i=0; i<TIMER_EVENT_COUNT; i++)
            {
                if (tTime2Event[i].active   == FALSE)
                {
                    tTime2Event[i].active   	= TRUE;
                    tTime2Event[i].initTick 	= uTimeTick;
                    tTime2Event[i].curTick  	= uTimeTick;
                    tTime2Event[i].funPtr   	= (TIMER_CALLBACK)pvFun;
                    tTime2Event[i].transParam   = parameter;
                    val = i;
                    break;
                }
            }
            break;
        }

        case TMR3:
        {
            bIsSetTime1Event = TRUE;
            uTime3EventCount++;
            for (i=0; i<TIMER_EVENT_COUNT; i++)
            {
                if (tTime3Event[i].active   == FALSE)
                {
                    tTime3Event[i].active   	= TRUE;
                    tTime3Event[i].initTick 	= uTimeTick;
                    tTime3Event[i].curTick  	= uTimeTick;
                    tTime3Event[i].funPtr   	= (TIMER_CALLBACK)pvFun;
                    tTime3Event[i].transParam   = parameter;
                    val = i;
                    break;
                }
            }
            break;
        }
        default:
        {
            break;
        }
    }

    return val;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_ClearTimerEvent                                                                     */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               channel    - [in],  TMR0/TMR1/TMR2/TMR3  					                               */
/*               uTimeEventNo - [in],EVENT No. it could be 0 ~ TIMER_EVENT_COUNT-1                         */
/*                                                                                                         */
/* Returns:                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*               This function is used to remove a installed event                                         */
/*---------------------------------------------------------------------------------------------------------*/
void DrvTIMER_ClearTimerEvent(TIMER_CHANNEL channel, uint32_t uTimeEventNo)
{
    switch (channel)
    {
        case TMR0:
        {
            tTime0Event[uTimeEventNo].active = FALSE;
            uTime0EventCount--;
            if (uTime0EventCount == 0)
            {
                bIsSetTime0Event = FALSE;
            }
            break;
        }
        case TMR1:
        {
            tTime1Event[uTimeEventNo].active = FALSE;
            uTime1EventCount--;
            if (uTime1EventCount == 0)
            {
                bIsSetTime1Event = FALSE;
            }
            break;
        }

        case TMR2:
        {
            tTime2Event[uTimeEventNo].active = FALSE;
            uTime2EventCount--;
            if (uTime2EventCount == 0)
            {
                bIsSetTime2Event = FALSE;
            }
            break;
        }

        case TMR3:
        {
            tTime3Event[uTimeEventNo].active = FALSE;
            uTime3EventCount--;
            if (uTime3EventCount == 0)
            {
                bIsSetTime3Event = FALSE;
            }
            break;
        }
        default:
        {
            break;
        }
    }
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     WDT_ResetCount                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               NONE                                                                                      */
/*                                                                                                         */
/* Returns:      NONE                                                                                      */
/*                                                                                                         */
/* Description:                                                                                            */
/*               This function is used to reset WDT Tick to avoid time-out to restart system.              */
/*---------------------------------------------------------------------------------------------------------*/
void DrvWDT_ResetCount(void)
{
    WDT->WTCR.WTR =1 ;

