DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvTimer.c
}




/*---------------------------------------------------------------------------------------------------------*/
/* Function:     WDT_SetEvent                                                                              */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               pvFun  - [in],The event function pointer                                                  */
/*                                                                                                         */
/* Returns:      NONE                                                                                      */
/*                                                                                                         */
/* Description:                                                                                            */
/*               This function is used to install a callback function in WDT 						       */
/*---------------------------------------------------------------------------------------------------------*/
void DrvWDT_SetEvent(TIMER_CALLBACK pvFun)
{
    bIsSetWdtEvent = TRUE;

    fnCallBack_WDT =  (TIMER_CALLBACK)pvFun;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     DrvTIMER_EnableInt                                                                        */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               channel    - [in],  TMR0/TMR1/TMR2/TMR3                                                   */
/*                                                                                                         */
/* Returns:      E_SUCCESS / TIMER_ERR_CHANNEL /                                                           */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to enable Interuppt                                                 */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvTIMER_EnableInt(TIMER_CHANNEL channel)
{
    switch (channel)
    {
        case TMR0:
        {
            TIMER0->TCSR.IE =1 ;
			NVIC_EnableIRQ(TMR0_IRQn); 
            break;
        }
        case TMR1:
        {
            TIMER1->TCSR.IE =1 ;
			NVIC_EnableIRQ(TMR1_IRQn); 
            break;
        }
        case TMR2:
        {
            TIMER2->TCSR.IE =1 ;
			NVIC_EnableIRQ(TMR2_IRQn); 
            break;
        }

        case TMR3:
        {
            TIMER3->TCSR.IE =1 ;
			NVIC_EnableIRQ(TMR3_IRQn); 
            break;
        }

        default:
        {
			return E_DRVTIMER_CHANNEL;
        }
    }
    
    return E_SUCCESS ;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_ResetTicks                                                                          */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               channel    - [in],  TMR0/TMR1/TMR2/TMR3                                                   */
/*                                                                                                         */
/* Returns:      E_SUCCESS / E_DRVTIMER_CHANNEL                                                            */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to reset TIMER Tick.                                                */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvTIMER_ResetTicks(TIMER_CHANNEL channel)
{
    switch (channel)
    {
        case TMR0:
        {
            uTimer0Count = 0;
            break;
        }
        case TMR1:
        {
            uTimer1Count = 0;
            break;
        }

        case TMR2:
        {
            uTimer2Count = 0;
            break;
        }

        case TMR3:
        {
            uTimer3Count = 0;
            break;
        }
        default:
        {
            return E_DRVTIMER_CHANNEL;
        }
    }
    return E_SUCCESS;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_Init                                                                                */
/*                                                                                                         */
/* Parameters:   NONE                                                                                      */
/*                                                                                                         */
/* Returns:      NONE                                                                                      */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               This function is used to initial TIMER when system boot up.                               */
/*---------------------------------------------------------------------------------------------------------*/
void DrvTIMER_Init(void)
{

    bIsTimer0Initial    = TRUE;
    bIsTimer1Initial    = TRUE;
	bIsTimer2Initial    = TRUE;
	bIsTimer3Initial    = TRUE;

