DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvTimer.c
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_Open                                                                                */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               channel        - [in], TMR0/TMR1/TMR2/TMR3                                                */
/*               uTickPerSecond - [in], Tick / second                                                      */
/*               Mode           - [in], Operation Mode One-Shot / Periodic / Toggle /UNINTERREUPT          */
/*                                                                                                         */
/* Returns:      E_SUCCESS / E_DRVTIMER_CMD / E_DRVTIMER_EIO                                               */
/* Description:                                                                                            */
/*               This function is used to set and start TIMER                                              */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvTIMER_Open(TIMER_CHANNEL channel, uint32_t uTicksPerSecond, TIMER_OPMODE mode )
{
    uint32_t i;
    uint32_t uRegTicr, uRegTcr;

    if ( (bIsTimer0Initial == FALSE)|(bIsTimer1Initial == FALSE)|(bIsTimer2Initial == FALSE)|(bIsTimer3Initial == FALSE))
    {
        return E_DRVTIMER_EIO;

    }

    uRegTcr = (uint32_t)( 0x60000000 | ( mode << 27) );        /* Start Timer and set operation mode       */
    
	

    switch (channel)
    {
        case TMR0:
        {
            if ( (bIsTimer0Initial != TRUE)|(bIsTimer0Used   != FALSE))
                return E_DRVTIMER_EIO;
            
            bIsTimer0Used   = TRUE;
           
		   	SYSCLK->APBCLK.TMR0_EN =1;
			
			outpw(&TIMER0->TCSR ,0 );                         /* disable timer                              */
           
		    TIMER0->TISR.TIF = 1;                             /* write 1 to clear for safty                 */

            for (i=0; i<TIMER_EVENT_COUNT; i++)
            {
                tTime0Event[i].active = FALSE;
            }
            uTimer0Count = 0;
			
			_sys_uTimer0TickPerSecond = uTicksPerSecond;
            		
			uRegTicr =  GetTimerCLk(TMR0) /uTicksPerSecond;

			if(uRegTicr > 0xFFFFFF)							  /* Init count is larger than 24bit            */		
			{
				return E_DRVTIMER_CMD;			
			}

			TIMER0->TICR = uRegTicr;
		
			outpw(&TIMER0->TCSR,  (uint32_t)uRegTcr);   
			
			NVIC_EnableIRQ(TMR0_IRQn); 

            break;
        }

        case TMR1:
        {
            if ( (bIsTimer1Initial != TRUE)|(bIsTimer1Used   != FALSE))
            {
                return E_DRVTIMER_EIO;
            }

            bIsTimer1Used   = TRUE;

            SYSCLK->APBCLK.TMR1_EN =1;
			
			outpw(&TIMER1->TCSR ,0 );                       	/* disable timer                               */
            
			TIMER1->TISR.TIF =1;                            	/* write 1 to clear for safty                  */

            for (i=0; i<TIMER_EVENT_COUNT; i++)
            {
                tTime1Event[i].active = FALSE;
            }
            uTimer1Count = 0;
            _sys_uTimer1TickPerSecond = uTicksPerSecond;

            uRegTicr = GetTimerCLk(TMR1) /uTicksPerSecond;

			if(uRegTicr > 0xFFFFFF)						   		/* Init count is larger than 24bit            */		
			{
				return E_DRVTIMER_CMD;			
			}

			TIMER1->TICR = uRegTicr;
			outpw(&TIMER1->TCSR, (uint32_t)uRegTcr);

			NVIC_EnableIRQ(TMR1_IRQn); 

            break;
        }


        case TMR2:
        {
            if ( (bIsTimer2Initial != TRUE)|(bIsTimer2Used   != FALSE))
            {
                return E_DRVTIMER_EIO;
    
            }
            bIsTimer2Used   = TRUE;

            SYSCLK->APBCLK.TMR2_EN =1;
			
			outpw(&TIMER2->TCSR ,0 );                              	/* disable timer                               */
            TIMER2->TISR.TIF =1;                       		      	/* write 1 to clear for safty                  */


            for (i=0; i<TIMER_EVENT_COUNT; i++)
            {
                tTime2Event[i].active = FALSE;
            }
            uTimer2Count = 0;
            _sys_uTimer2TickPerSecond = uTicksPerSecond;

            uRegTicr = GetTimerCLk(TMR2) /uTicksPerSecond;
 			
			if(uRegTicr > 0xFFFFFF)							  		/* Init count is larger than 24bit            */		
			{
				return E_DRVTIMER_CMD;			
			}

			TIMER2->TICR = uRegTicr;
			outpw(&TIMER2->TCSR, (uint32_t)uRegTcr);

			NVIC_EnableIRQ(TMR2_IRQn); 

            break;
        }

		case TMR3:
        {
            if ( (bIsTimer3Initial != TRUE)|(bIsTimer3Used   != FALSE))
            {
                return E_DRVTIMER_EIO;
    
            }

            bIsTimer3Used   = TRUE;

            SYSCLK->APBCLK.TMR3_EN =1;

			outpw(&TIMER3->TCSR ,0 );                               /* disable timer                               */
            TIMER3->TISR.TIF =1;                                   	/* write 1 to clear for safty                  */

            for (i=0; i<TIMER_EVENT_COUNT; i++)
            {
                tTime3Event[i].active = FALSE;
            }
            uTimer3Count = 0;
            _sys_uTimer3TickPerSecond = uTicksPerSecond;
            
			uRegTicr = GetTimerCLk(TMR3) /uTicksPerSecond;

			if(uRegTicr > 0xFFFFFF)							  		/* Init count is larger than 24bit            */		
			{
				return E_DRVTIMER_CMD;			
			}

			TIMER3->TICR = uRegTicr;
			outpw(&TIMER3->TCSR, (uint32_t)uRegTcr);

			NVIC_EnableIRQ(TMR3_IRQn); 

            break;
        }

        default:
        {
            return E_DRVTIMER_CMD ;
 
