DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvTimer.c
        }
    }
    return E_SUCCESS;

}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_GetTicks                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               channel      - [in], TMR0/TMR1/TMR2/TMR3                                                  */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               uTimer0Count - [out], Timer0 Current ticks                                                */
/*               uTimer1Count - [out], Timer1 Current ticks                                                */
/*               uTimer2Count - [out], Timer2 Current ticks                                                */
/*               uTimer3Count - [out], Timer3 Current ticks                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*               This function is used to return Timer ticks                                               */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t DrvTIMER_GetTicks(TIMER_CHANNEL channel)
{

    switch (channel)
    {
        case TMR0:
        {
            return uTimer0Count;
  
        }
        case TMR1:
        {
            return uTimer1Count;

        }	
        case TMR2:
        {
            return uTimer2Count;

        }
        case TMR3:
        {
            return uTimer3Count;

        }
        default:
        {
            break;
        }
    }
    return 0;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_Delay                                                                               */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               uTicks - [in], The delay time and it is depend on Timer CLK.                              */
/*                                                                                                         */
/* Returns:      None                                                                                      */
/*                                                                                                         */
/* Description:                                                                                            */
/*               This function is used to set a delay time if necessary. The TIMER0 is used in this delay  */
/*               function thus it needs to be opened and initialized first.                                */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
void DrvTIMER_Delay(uint32_t uTicks)
{
    uint32_t volatile btime;

    btime = DrvTIMER_GetTicks(TMR0);
    
    while (1)
    {
        if ((DrvTIMER_GetTicks(TMR0) - btime) > uTicks)
        {
            break;
        }
    }

}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_Ioctl                                                                               */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               channel - [in],   TMR0/TMR1/TMR2/TMR3                                                     */
/*               uCmd    - [in],   Reference TIMER_IOCRL_Table                                             */
/*               uArg1   - [in],   The first parameter for IOCRL                                           */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               E_SUCCESS          Success                                                                */
/*               E_DRVTIMER_CMD     Command Error                                                          */
/*                                                                                                         */
/* Description:                                                                                            */
/*               To process the general control of timer.                                                  */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvTIMER_Ioctl(TIMER_CHANNEL channel, TIMER_CMD uCmd,uint32_t uArg1)
{

    switch (uCmd)
    {
        case TIMER_IOC_START_COUNT :		  	/* Start Timer Count */
        {
            if(channel == TMR0)
				TIMER0->TCSR.CEN =1 ;
			else if(channel == TMR1)
				TIMER1->TCSR.CEN =1 ;
			else if(channel == TMR2)
				TIMER2->TCSR.CEN =1 ;
			else if(channel == TMR3)
				TIMER3->TCSR.CEN =1 ;
			else
				return E_DRVTIMER_CHANNEL;						

			break;
        }
        case TIMER_IOC_STOP_COUNT :				/* Stop Timer Count */
        {
            if(channel == TMR0)
				TIMER0->TCSR.CEN =0 ;
			else if(channel == TMR1)
				TIMER1->TCSR.CEN =0 ;
			else if(channel == TMR2)
				TIMER2->TCSR.CEN =0 ;
			else if(channel == TMR3)
				TIMER3->TCSR.CEN =0 ;
			else
				return E_DRVTIMER_CHANNEL;						

            break;
        }
        case TIMER_IOC_ENABLE_INT :			   	/* Enable Specified Channel Interrupt */
        {
			if(channel == TMR0)
				TIMER0->TCSR.IE =1 ;
			else if(channel == TMR1)
				TIMER1->TCSR.IE =1 ;
			else if(channel == TMR2)
				TIMER2->TCSR.IE =1 ;
			else if(channel == TMR3)
				TIMER3->TCSR.IE =1 ;
			else
				return E_DRVTIMER_CHANNEL;
            break;
        }

