DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvTimer.c
        case TIMER_IOC_DISABLE_INT :			/* Disable Specified Channel Interrupt */
        {
			if(channel == TMR0)
				TIMER0->TCSR.IE =0 ;
			else if(channel == TMR1)
				TIMER1->TCSR.IE =0 ;
			else if(channel == TMR2)
				TIMER2->TCSR.IE =0 ;
			else if(channel == TMR3)
				TIMER3->TCSR.IE =0 ;
			else
				return E_DRVTIMER_CHANNEL;

            break;
        }

        case TIMER_IOC_RESET_TIMER :			/* Reset specified channel */
        {
			if(channel == TMR0)
				TIMER0->TCSR.CRST =1 ;
			else if(channel == TMR1)
				TIMER1->TCSR.CRST =1 ;
			else if(channel == TMR2)
				TIMER2->TCSR.CRST =1 ;
			else if(channel == TMR3)
				TIMER3->TCSR.CRST =1 ;
			else
				return E_DRVTIMER_CHANNEL;
            break;
        }

        case TIMER_IOC_SET_PRESCALE  :			/* Set Specified channel prescale parameter */
        {
     		if(channel == TMR0)
				TIMER0->TCSR.PRESCALE = uArg1 ;
			else if(channel == TMR1)
				TIMER1->TCSR.PRESCALE = uArg1 ;
			else if(channel == TMR2)
				TIMER2->TCSR.PRESCALE = uArg1 ;
			else if(channel == TMR3)
				TIMER3->TCSR.PRESCALE = uArg1 ;
			else
				return E_DRVTIMER_CHANNEL;
            break;
        }

        case TIMER_IOC_SET_INITIAL_COUNT :	  	/* Set Inital Count value */
        {
            if(channel == TMR0)
				TIMER0->TICR = uArg1 ;
			else if(channel == TMR1)
				TIMER1->TICR = uArg1 ;
			else if(channel == TMR2)
				TIMER2->TICR = uArg1 ;
			else if(channel == TMR3)
				TIMER3->TICR = uArg1 ;
			else
				return E_DRVTIMER_CHANNEL;

            break;
        }

        default:
        {
            return E_DRVTIMER_CMD;
  
        }
    }

    return E_SUCCESS;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     TIMER_Close                                                                               */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               channel 	- [in],  TMR0 / TMR1 / TMR2 / TMR3                                             */
/* Returns:                                                                                                */
/*               E_SUCCESS          Success                                                                */
/*               E_DRVTIMER_CMD     Command Error                                                          */
/* Description:                                                                                            */
/*               The function is used to disable timer                                                     */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvTIMER_Close(TIMER_CHANNEL channel)
{

    if (channel > TMR3)
	{
        return E_DRVTIMER_CMD;
    }

    switch (channel)
    {
        case TMR0:
        {
            bIsTimer0Used       = FALSE;
            bIsSetTime0Event    = FALSE;
            DrvTIMER_Ioctl(TMR0, TIMER_IOC_DISABLE_INT, 0);
            DrvTIMER_Ioctl(TMR0, TIMER_IOC_RESET_TIMER, 0);
            break;

        }
        case TMR1:
        {
            bIsTimer1Used       = FALSE;
            bIsSetTime1Event    = FALSE;
            DrvTIMER_Ioctl(TMR1,TIMER_IOC_DISABLE_INT,  0);
            DrvTIMER_Ioctl(TMR1, TIMER_IOC_RESET_TIMER, 0);
            break;

        }
        case TMR2:
        {
            bIsTimer2Used       = FALSE;
            bIsSetTime2Event    = FALSE;
            DrvTIMER_Ioctl(TMR2, TIMER_IOC_DISABLE_INT,0);
            DrvTIMER_Ioctl(TMR2, TIMER_IOC_RESET_TIMER,0);
            break;

        }

        case TMR3:
        {
            bIsTimer3Used       = FALSE;
            bIsSetTime3Event    = FALSE;
            DrvTIMER_Ioctl(TMR3, TIMER_IOC_DISABLE_INT,0);
            DrvTIMER_Ioctl(TMR3, TIMER_IOC_RESET_TIMER,0);
            break;

        }
        default:
        {
            return E_DRVTIMER_CMD ;
        }
    }

    return E_SUCCESS;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function: WDT_InstallISR                                                                                */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               TIMER_CALLBACK pvNewISR                     ISR name                                      */
/*                                                                                                         */
/* Returns:      mOldVect                                                                                  */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               The function is used to install watching Dog ISR                                          */
/*---------------------------------------------------------------------------------------------------------*/
void DrvWDT_InstallISR(TIMER_CALLBACK pvNewISR)
{
	WDT->WTCR.WTIE =1 ;
	fnCallBack_WDT = (TIMER_CALLBACK)pvNewISR; 
	NVIC_EnableIRQ(WDT_IRQn); 
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function: WDT_SetInterval                                                                               */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               nWdtInterval -[in] ,  Wathching Dog time-out Interval                                     */
/*                                                                                                         */
/* Returns:      E_SUCCESS                                                                                 */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               The function is used to set the "Interval Level" of WDT Time-out                          */
/*---------------------------------------------------------------------------------------------------------*/
static int32_t WDT_SetInterval(WDT_INTERVAL nWdtInterval)
{

	WDT->WTCR.WTIS = nWdtInterval;

    return E_SUCCESS;
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function:     WDT_Init                                                                                  */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               None                                                                                      */
/*                                                                                                         */
/* Returns:                                                                                                */
/*               None                                                                                      */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function is used to initial Watch Dog Timer                                           */
/*---------------------------------------------------------------------------------------------------------*/
void DrvWDT_Init(void)
{
    bIsSetWdtEvent  = FALSE;
	bIsWdtTimeOut 	= FALSE;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     WDT_Open                                                                                  */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               hander   -[in]  NULL                                                                      */
/*               level    -[in]  WDT time-out level. It could be LEVEL0~7                                  */
/*                                                                                                         */
/* Returns:      E_SUCCESS                                                                                 */
/* Description:                                                                                            */
/*               The function is used to set WDT Interval and Star Timer to count                          */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvWDT_Open(int32_t hander ,WDT_INTERVAL level)
{
    
    WDT_SetInterval(level);              /* Select WatchDog Timer Interval                                 */
    
    WDT->WTCR.WTE = 1 ;                   /* Start WatchDog Timer                                           */
 
    return E_SUCCESS;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     WDT_IRQHandler                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               NONE                                                                                      */
/*                                                                                                         */
/* Returns:      NONE                                                                                      */
/* Side effects:                                                                                           */
/* Description:                                                                                            */
/*               The function is default Watching Dog Interrupt Service Rotiune                            */
/*---------------------------------------------------------------------------------------------------------*/
void WDT_IRQHandler(void)
{

    WDT->WTCR.WTIF =1;                  				/* Clear INT32 Flag                                */

    bIsWdtTimeOut = TRUE;

    if (bIsSetWdtEvent==TRUE)                           /* Install WDT Callback Function                   */
    {
         fnCallBack_WDT(NULL);
    }

