DerpyTBPz/ARM/rgr/NuvotonPlatform_Keil/Book/CH12-01_uCOS/NUC100 uCOS-II Patch_Fix/NUC1XX uCOS-II Patch/Micrium/Software/Evalboards/NUC1XX_BSP/NuvotonPlatform_Keil/Src/Driver/DrvTimer.c
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     WDT_Ioctl                                                                                 */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               hander 		-[in]   NULL                                                               */
/*               uCmd           -[in]   WDT IOCTL command                                                  */
/*               uArg1   		-[in]   First argument of the command                                      */
/*                                                                                                         */
/* Returns:      E_SUCCESS                                                                                 */
/*                                                                                                         */
/* Description:                                                                                            */
/*               The function of Watching Dog Timer IO Control API                                         */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvWDT_Ioctl(int32_t hander ,WDT_CMD uCmd , uint32_t uArg1)
{
    switch (uCmd)
    {
        case WDT_IOC_START_TIMER  :
        {
 			WDT->WTCR.WTE = 1 ;
            break ;
        }

        case WDT_IOC_STOP_TIMER :
        {
 			WDT->WTCR.WTE = 0 ;
            break ;
        }

        case WDT_IOC_ENABLE_INT :
        {
 			WDT->WTCR.WTIE = 1 ;
            break ;
        }

        case WDT_IOC_DISABLE_INT :
        {
  			WDT->WTCR.WTIE = 0 ;
            break ;
        }

        case WDT_IOC_RESET_TIMER:
        {
 			WDT->WTCR.WTR = 1 ;
            break ;
        }
        case WDT_IOC_ENABLE_RESET_FUNC :
        {
			WDT->WTCR.WTRE = 1 ;
            break ;
        }
        case WDT_IOC_DISABLE_RESET_FUNC:
        {
 			WDT->WTCR.WTRE = 0 ;
            break ;
        }

        case WDT_IOC_SET_INTERVAL:
        {
            WDT_SetInterval((WDT_INTERVAL)uArg1);

            break ;
        }
       
		default :
        {
            return E_DRVTIMER_CMD;
        }
    }

    return E_SUCCESS;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function:     WDT_Close                                                                                 */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               NONE                                                                                      */
/*                                                                                                         */
/* Returns:      E_SUCCESS                                                                                 */
/* Description:                                                                                            */
/*               The function is used to Stop Wathch Dog Timer and Disable WDT Interrupt                   */
/*---------------------------------------------------------------------------------------------------------*/
void DrvWDT_Close(void)
{
    bIsSetWdtEvent      = FALSE;
    bIsWdtTimeOut       = FALSE;
    DrvWDT_Ioctl(0,WDT_IOC_STOP_TIMER ,0);    /* Stop Timer                                                */
    DrvWDT_Ioctl(0,WDT_IOC_DISABLE_INT ,0);   /* Disable INT                                               */
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvTIMER_GetVersion                                                                           */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*              None                                                                                       */
/*                                                                                                         */
/* Returns:                                                                                                */
/*              None                                                                                       */
/*                                                                                                         */
/* Description:                                                                                            */
/*              Get the version number of Timer/WDT driver.                                                */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
int32_t DrvTIMER_GetVersion(void)
{
	return DRVTIMER_VERSION_NUM;
}

